app/controllers/courses_controller.rb

INSERT INTO "courses" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "React1"], ["created_at", "2024-03-11 14:23:30.203749"], ["updated_at", "2024-03-11 14:23:30.203749"]]
---
  def create
    @course = Course.new(course_params)
    enroll_authors

    respond_to do |format|
      if @course.save

UPDATE "courses" SET "name" = $1, "updated_at" = $2 WHERE "courses"."id" = $3  [["name", "ruby and rails"], ["updated_at", "2024-03-11 12:28:40.879308"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @course.update(course_params)