app/controllers/talents_controller.rb

SELECT "talents".* FROM "talents"
---
  def index
    @talents = Talent.all

INSERT INTO "talents" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Gautam"], ["email", "gautam@gmail.com"], ["created_at", "2024-03-11 15:43:38.144350"], ["updated_at", "2024-03-11 15:43:38.144350"]]
---
  def create
    @talent = Talent.new(talent_params)

    if @talent.save

UPDATE "talents" SET "name" = $1, "updated_at" = $2 WHERE "talents"."id" = $3  [["name", "Smiley Sachdeva"], ["updated_at", "2024-03-11 15:44:53.719464"], ["id", 1]]
---
  def update
    if @talent.update(talent_params)

DELETE FROM "talents" WHERE "talents"."id" = $1  [["id", 1]]
---
  def destroy
    @talent.destroy

SELECT "talents".* FROM "talents" WHERE "talents"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_talent
      @talent = Talent.find(params[:id])